aws/amazon-freertos/vendors/renesas/rx_mcu_boards/rx_driver_package/v125/r_s12ad_rx/src/targets/rx23w/r_s12ad_rx23w.c
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);

    /* Show driver as closed */

    g_dcb.opened = false;

    return ADC_SUCCESS;
} /* End of function adc_close() */


/******************************************************************************
* Function Name: adc_read_all
* Description  : This is the RX23W implementation of R_ADC_ReadAll().
*                It reads conversion results from all potential sources,
*                enabled or not.
* Arguments    : p_all_data-
*                    Pointer to structure to load register values into.
* Return Value : ADC_SUCCESS-
*                    Successful
*******************************************************************************/
adc_err_t adc_read_all(adc_data_t * const  p_all_data)
{
    p_all_data->chan[ADC_REG_CH0]  = S12AD.ADDR0;
    p_all_data->chan[ADC_REG_CH1]  = S12AD.ADDR1;
    p_all_data->chan[ADC_REG_CH2]  = S12AD.ADDR2;
    p_all_data->chan[ADC_REG_CH3]  = S12AD.ADDR3;
    p_all_data->chan[ADC_REG_CH4]  = S12AD.ADDR4;
    p_all_data->chan[ADC_REG_CH5]  = S12AD.ADDR5;
    p_all_data->chan[ADC_REG_CH6]  = S12AD.ADDR6;
    p_all_data->chan[ADC_REG_CH7]  = S12AD.ADDR7;

    p_all_data->chan[ADC_REG_CH16] = S12AD.ADDR16;
    p_all_data->chan[ADC_REG_CH17] = S12AD.ADDR17;
    p_all_data->chan[ADC_REG_CH18] = S12AD.ADDR18;
    p_all_data->chan[ADC_REG_CH19] = S12AD.ADDR19;
    p_all_data->chan[ADC_REG_CH20] = S12AD.ADDR20;

    p_all_data->chan[ADC_REG_CH27] = S12AD.ADDR27;

    p_all_data->temp               = S12AD.ADTSDR;
    p_all_data->volt               = S12AD.ADOCDR;

    p_all_data->dbltrig            = S12AD.ADDBLDR;
    p_all_data->self_diag          = S12AD.ADRD.WORD;

    return ADC_SUCCESS;
} /* End of function adc_read_all() */


#endif /* #if defined BSP_MCU_RX23W */

